modm-ext/archive-stmicro-svd/header_stm32f745iek6.svd
      <register>
        <name>FGCLUT.175</name>
        <addressOffset>0x6bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.176</name>
        <addressOffset>0x6c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.177</name>
        <addressOffset>0x6c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.178</name>
        <addressOffset>0x6c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.179</name>
        <addressOffset>0x6cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.180</name>
        <addressOffset>0x6d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.181</name>
        <addressOffset>0x6d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.182</name>
        <addressOffset>0x6d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.183</name>
        <addressOffset>0x6dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.184</name>
        <addressOffset>0x6e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.185</name>
        <addressOffset>0x6e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.186</name>
        <addressOffset>0x6e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.187</name>
        <addressOffset>0x6ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.188</name>
        <addressOffset>0x6f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.189</name>
        <addressOffset>0x6f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.190</name>
        <addressOffset>0x6f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.191</name>
        <addressOffset>0x6fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.192</name>
        <addressOffset>0x700</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.193</name>
        <addressOffset>0x704</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.194</name>
        <addressOffset>0x708</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.195</name>
        <addressOffset>0x70c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.196</name>
        <addressOffset>0x710</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.197</name>
        <addressOffset>0x714</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.198</name>
        <addressOffset>0x718</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.199</name>
        <addressOffset>0x71c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.200</name>
        <addressOffset>0x720</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.201</name>
        <addressOffset>0x724</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.202</name>
        <addressOffset>0x728</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.203</name>
        <addressOffset>0x72c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.204</name>
        <addressOffset>0x730</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.205</name>
        <addressOffset>0x734</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.206</name>
        <addressOffset>0x738</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.207</name>
        <addressOffset>0x73c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.208</name>
        <addressOffset>0x740</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.209</name>
        <addressOffset>0x744</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.210</name>
        <addressOffset>0x748</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.211</name>
        <addressOffset>0x74c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.212</name>
        <addressOffset>0x750</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.213</name>
        <addressOffset>0x754</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.214</name>
        <addressOffset>0x758</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.215</name>
        <addressOffset>0x75c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.216</name>
        <addressOffset>0x760</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.217</name>
        <addressOffset>0x764</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.218</name>
        <addressOffset>0x768</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.219</name>
        <addressOffset>0x76c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.220</name>
        <addressOffset>0x770</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.221</name>
        <addressOffset>0x774</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.222</name>
        <addressOffset>0x778</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.223</name>
        <addressOffset>0x77c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.224</name>
        <addressOffset>0x780</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.225</name>
        <addressOffset>0x784</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.226</name>
        <addressOffset>0x788</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.227</name>
        <addressOffset>0x78c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.228</name>
        <addressOffset>0x790</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.229</name>
        <addressOffset>0x794</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.230</name>
        <addressOffset>0x798</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.231</name>
        <addressOffset>0x79c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.232</name>
        <addressOffset>0x7a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.233</name>
        <addressOffset>0x7a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.234</name>
        <addressOffset>0x7a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.235</name>
        <addressOffset>0x7ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.236</name>
        <addressOffset>0x7b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.237</name>
        <addressOffset>0x7b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.238</name>
        <addressOffset>0x7b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.239</name>
        <addressOffset>0x7bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.240</name>
        <addressOffset>0x7c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.241</name>
        <addressOffset>0x7c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.242</name>
        <addressOffset>0x7c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.243</name>
        <addressOffset>0x7cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.244</name>
        <addressOffset>0x7d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.245</name>
        <addressOffset>0x7d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.246</name>
        <addressOffset>0x7d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.247</name>
        <addressOffset>0x7dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.248</name>
        <addressOffset>0x7e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.249</name>
        <addressOffset>0x7e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.250</name>
        <addressOffset>0x7e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.251</name>
        <addressOffset>0x7ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.252</name>
        <addressOffset>0x7f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.253</name>
        <addressOffset>0x7f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.254</name>
        <addressOffset>0x7f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.255</name>
        <addressOffset>0x7fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.0</name>
        <addressOffset>0x800</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.1</name>
        <addressOffset>0x804</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.2</name>
        <addressOffset>0x808</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.3</name>
        <addressOffset>0x80c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.4</name>
        <addressOffset>0x810</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.5</name>
        <addressOffset>0x814</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.6</name>
        <addressOffset>0x818</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.7</name>
        <addressOffset>0x81c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.8</name>
        <addressOffset>0x820</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.9</name>
        <addressOffset>0x824</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.10</name>
        <addressOffset>0x828</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.11</name>
        <addressOffset>0x82c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.12</name>
        <addressOffset>0x830</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.13</name>
        <addressOffset>0x834</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.14</name>
        <addressOffset>0x838</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.15</name>
        <addressOffset>0x83c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.16</name>
        <addressOffset>0x840</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.17</name>
        <addressOffset>0x844</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.18</name>
        <addressOffset>0x848</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.19</name>
        <addressOffset>0x84c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.20</name>
        <addressOffset>0x850</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.21</name>
        <addressOffset>0x854</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.22</name>
        <addressOffset>0x858</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.23</name>
        <addressOffset>0x85c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.24</name>
        <addressOffset>0x860</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.25</name>
        <addressOffset>0x864</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.26</name>
        <addressOffset>0x868</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.27</name>
        <addressOffset>0x86c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.28</name>
        <addressOffset>0x870</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.29</name>
        <addressOffset>0x874</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.30</name>
        <addressOffset>0x878</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.31</name>
        <addressOffset>0x87c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.32</name>
        <addressOffset>0x880</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.33</name>
        <addressOffset>0x884</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.34</name>
        <addressOffset>0x888</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.35</name>
        <addressOffset>0x88c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.36</name>
        <addressOffset>0x890</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.37</name>
        <addressOffset>0x894</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.38</name>
        <addressOffset>0x898</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.39</name>
        <addressOffset>0x89c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.40</name>
        <addressOffset>0x8a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.41</name>
        <addressOffset>0x8a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.42</name>
        <addressOffset>0x8a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.43</name>
        <addressOffset>0x8ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.44</name>
        <addressOffset>0x8b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.45</name>
        <addressOffset>0x8b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.46</name>
        <addressOffset>0x8b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.47</name>
        <addressOffset>0x8bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.48</name>
        <addressOffset>0x8c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.49</name>
        <addressOffset>0x8c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.50</name>
        <addressOffset>0x8c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.51</name>
        <addressOffset>0x8cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.52</name>
        <addressOffset>0x8d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.53</name>
        <addressOffset>0x8d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.54</name>
        <addressOffset>0x8d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.55</name>
        <addressOffset>0x8dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.56</name>
        <addressOffset>0x8e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.57</name>
        <addressOffset>0x8e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.58</name>
        <addressOffset>0x8e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.59</name>
        <addressOffset>0x8ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.60</name>
        <addressOffset>0x8f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.61</name>
        <addressOffset>0x8f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.62</name>
        <addressOffset>0x8f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.63</name>
        <addressOffset>0x8fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.64</name>
        <addressOffset>0x900</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.65</name>
        <addressOffset>0x904</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.66</name>
        <addressOffset>0x908</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.67</name>
        <addressOffset>0x90c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.68</name>
        <addressOffset>0x910</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.69</name>
        <addressOffset>0x914</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.70</name>
        <addressOffset>0x918</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.71</name>
        <addressOffset>0x91c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.72</name>
        <addressOffset>0x920</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.73</name>
        <addressOffset>0x924</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.74</name>
        <addressOffset>0x928</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.75</name>
        <addressOffset>0x92c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.76</name>
        <addressOffset>0x930</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.77</name>
        <addressOffset>0x934</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.78</name>
        <addressOffset>0x938</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.79</name>
        <addressOffset>0x93c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.80</name>
        <addressOffset>0x940</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.81</name>
        <addressOffset>0x944</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.82</name>
        <addressOffset>0x948</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.83</name>
        <addressOffset>0x94c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.84</name>
        <addressOffset>0x950</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.85</name>
        <addressOffset>0x954</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.86</name>
        <addressOffset>0x958</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.87</name>
        <addressOffset>0x95c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.88</name>
        <addressOffset>0x960</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.89</name>
        <addressOffset>0x964</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.90</name>
        <addressOffset>0x968</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.91</name>
        <addressOffset>0x96c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.92</name>
        <addressOffset>0x970</addressOffset>
        <size>0x20</size>
      </register>
